

if __name__ == '__main__':
    print('==========>元组与列表<==========')
    p = ['abc', 123]
    print('{0[1]}---{0[0]}'.format(p))

    print('==========>按位选择<==========')
    print('{1}-{0}-{1}'.format('a', 5))

    print('==========>保留小数位数<==========')
    print('{:.2f}'.format(123.1123))

    print('==========>带符号<==========')
    print('{:+.2f}'.format(123.1123))
    print('{:+.2f}'.format(-123.1123))
    print('{:+d}'.format(-12))

    print('==========>对齐<==========')
    print('{:<8}'.format(123))
    print('{:>8}'.format(123))
    print('{:^8}'.format(123))

    print('==========>填充字符<==========')
    print('{:k<8}'.format(123))
    print('{:k>8}'.format(123))
    print('{:k^8}'.format(123))

    print('==========>逗号分隔数字<==========')
    print('{:,}'.format(1000000))

    print('==========>百分比格式<==========')
    print('{:.2%}'.format(0.3412))

    print('==========>指数格式<==========')
    print('{:.2e}'.format(0.3412))

    print('==========>进制转换<==========')
    print('  二进制： {0:b}'.format(77777))
    print('  八进制： {0:o}'.format(77777))
    print('  十进制： {0:d}'.format(77777))
    print('十六进制： {0:x}  {0:X}'.format(77777))

    print('==========>转化类型<==========')
    print('{!r}  {!s}  {!a}'.format(1, 2, 5))
